zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5e5xx.h
/**
  * @brief DMA2D Controller
  */
typedef struct
{
  __IO uint32_t CR;              /*!< DMA2D control register                            Address offset: 0x000 */
       uint32_t RESERVED0[3];    /*!< Reserved                                          Address offset: 0x004-0x00C */
  __IO uint32_t ISR;             /*!< DMA2D interrupt status register                   Address offset: 0x010 */
  __IO uint32_t IER;             /*!< DMA2D interrupt enable register                   Address offset: 0x014 */
  __IO uint32_t IFCR;            /*!< DMA2D interrupt flag clear register               Address offset: 0x018 */
       uint32_t RESERVED1[9];    /*!< Reserved                                          Address offset: 0x01C-0x03C */
  __IO uint32_t FGMAR;           /*!< DMA2D foreground memory address register          Address offset: 0x040 */
  __IO uint32_t FGOR;            /*!< DMA2D foreground offset register                  Address offset: 0x044 */
       uint32_t RESERVED2;       /*!< Reserved                                          Address offset: 0x048 */
  __IO uint32_t FGMSR;           /*!< DMA2D foreground memory skip register             Address offset: 0x04C */
  __IO uint32_t FGPFCCR;         /*!< DMA2D foreground PFC control register             Address offset: 0x050 */
  __IO uint32_t FGCOLR;          /*!< DMA2D foreground color register                   Address offset: 0x054 */
  __IO uint32_t FGCMAR;          /*!< DMA2D foreground CLUT memory address register     Address offset: 0x058 */
       uint32_t RESERVED3[9];    /*!< Reserved                                          Address offset: 0x05C-0x07C */
  __IO uint32_t BGMAR;           /*!< DMA2D background memory address register          Address offset: 0x080 */
  __IO uint32_t BGOR;            /*!< DMA2D background offset register                  Address offset: 0x084 */
       uint32_t RESERVED4;       /*!< Reserved                                          Address offset: 0x088 */
  __IO uint32_t BGMSR;           /*!< DMA2D background memory skip register             Address offset: 0x08C */
  __IO uint32_t BGPFCCR;         /*!< DMA2D background PFC control register             Address offset: 0x090 */
  __IO uint32_t BGCOLR;          /*!< DMA2D background color register                   Address offset: 0x094 */
  __IO uint32_t BGCMAR;          /*!< DMA2D background CLUT memory address register     Address offset: 0x098 */
       uint32_t RESERVED5[9];    /*!< Reserved                                          Address offset: 0x09C-0x0BC */
  __IO uint32_t OPFCCR;          /*!< DMA2D output PFC control register                 Address offset: 0x0C0 */
  __IO uint32_t OCOLR;           /*!< DMA2D output color register                       Address offset: 0x0C4 */
  __IO uint32_t OMAR;            /*!< DMA2D output memory address register              Address offset: 0x0C8 */
  __IO uint32_t OOR;             /*!< DMA2D output offset register                      Address offset: 0x0CC */
  __IO uint32_t NLR;             /*!< DMA2D number of line register                     Address offset: 0x0D0 */
       uint32_t RESERVED6[3];    /*!< Reserved                                          Address offset: 0x0D4-0x0DC */
  __IO uint32_t LWR;             /*!< DMA2D line watermark register                     Address offset: 0x0E0 */
       uint32_t RESERVED7[3];    /*!< Reserved                                          Address offset: 0x0E4-0x0EC */
  __IO uint32_t AMTCR;           /*!< DMA2D AHB master timer configuration register     Address offset: 0x0F0 */
       uint32_t RESERVED8[3];    /*!< Reserved                                          Address offset: 0x0F4-0x0FC */
  __IO uint32_t SBCR;            /*!< DMA2D stencil buffer configuration register       Address offset: 0x100 */
  __IO uint32_t SBMAR;           /*!< DMA2D stencil buffer memory address register      Address offset: 0x104 */
  __IO uint32_t SBOR;            /*!< DMA2D stencil buffer offset register              Address offset: 0x108 */
       uint32_t RESERVED9;       /*!< Reserved                                          Address offset: 0x10C */
  __IO uint32_t SBMSR;           /*!< DMA2D stencil buffer memory skip register         Address offset: 0x110 */
       uint32_t RESERVED10[11];  /*!< Reserved                                          Address offset: 0x114-0x13C */
  __IO uint32_t TBCR;            /*!< DMA2D tile buffer configuration register          Address offset: 0x140 */
       uint32_t RESERVED11[15];  /*!< Reserved                                          Address offset: 0x144-0x17C */
  __IO uint32_t SCR;             /*!< DMA2D scaler configuration register               Address offset: 0x180 */
  __IO uint32_t SNLR;            /*!< DMA2D scaler number of line register              Address offset: 0x184 */
  __IO uint32_t SSR;             /*!< DMA2D scaler step register                        Address offset: 0x188 */
  __IO uint32_t SPR;             /*!< DMA2D scaler phase register                       Address offset: 0x18C */
       uint32_t RESERVED12[28];  /*!< Reserved                                          Address offset: 0x190-0x1FC */
  __IO uint32_t GPFCR;           /*!< DMA2D general purpose flag configuration register Address offset: 0x200 */
  __IO uint32_t GPFR;            /*!< DMA2D general purpose flag register               Address offset: 0x204 */
  __IO uint32_t GPFSR;           /*!< DMA2D general purpose flag set register           Address offset: 0x208 */
  __IO uint32_t GPFRR;           /*!< DMA2D general purpose flag reset register         Address offset: 0x20C */
       uint32_t RESERVED13[12];  /*!< Reserved                                          Address offset: 0x210-0x23C */
  __IO uint32_t CLCR;            /*!< DMA2D command list configuration register         Address offset: 0x240 */
  __IO uint32_t CLSR;            /*!< DMA2D command list status register                Address offset: 0x244 */
       uint32_t RESERVED14[2];   /*!< Reserved                                          Address offset: 0x248-0x24C */
  __IO uint32_t RBBAR;           /*!< DMA2D ring buffer base address register           Address offset: 0x250 */
  __IO uint32_t RBHPR;           /*!< DMA2D ring buffer head pointer register           Address offset: 0x254 */
  __IO uint32_t RBWPR;           /*!< DMA2D ring buffer write pointer register          Address offset: 0x258 */
       uint32_t RESERVED15;      /*!< Reserved                                          Address offset: 0x25C */
  __IO uint32_t LBCBAR;          /*!< DMA2D linear buffer current base address register Address offset: 0x260 */
  __IO uint32_t LBCSR;           /*!< DMA2D linear buffer current size register         Address offset: 0x264 */
  __IO uint32_t LBCAR;           /*!< DMA2D linear buffer current address register      Address offset: 0x268 */
       uint32_t RESERVED16[98];  /*!< Reserved                                          Address offset: 0x26C-0x3F0 */
  __IO uint32_t VERR;            /*!< DMA2D version register                            Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< DMA2D identification register                     Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< DMA2D size identification register                Address offset: 0x3FC */
  __IO uint32_t FGCLUT[256];     /*!< DMA2D foreground CLUT                             Address offset: 0x400 */
  __IO uint32_t BGCLUT[256];     /*!< DMA2D background CLUT                             Address offset: 0x800 */

} DMA2D_TypeDef;
/**
  * @brief LCD-TFT Display Controller
  */
typedef struct
{
  uint32_t      RESERVED0[2];  /*!< Reserved, 0x00-0x04 */
  __IO uint32_t SSCR;          /*!< LTDC Synchronization Size Configuration Register,    Address offset: 0x08  */
  __IO uint32_t BPCR;          /*!< LTDC Back Porch Configuration Register,              Address offset: 0x0C  */
  __IO uint32_t AWCR;          /*!< LTDC Active Width Configuration Register,            Address offset: 0x10  */
  __IO uint32_t TWCR;          /*!< LTDC Total Width Configuration Register,             Address offset: 0x14  */
  __IO uint32_t GCR;           /*!< LTDC Global Control Register,                        Address offset: 0x18  */
  uint32_t      RESERVED1[2];  /*!< Reserved, 0x1C-0x20 */
  __IO uint32_t SRCR;          /*!< LTDC Shadow Reload Configuration Register,           Address offset: 0x24  */
  uint32_t      RESERVED2[1];  /*!< Reserved, 0x28 */
  __IO uint32_t BCCR;          /*!< LTDC Background Color Configuration Register,        Address offset: 0x2C  */
  uint32_t      RESERVED3[1];  /*!< Reserved, 0x30 */
  __IO uint32_t IER;           /*!< LTDC Interrupt Enable Register,                      Address offset: 0x34  */
  __IO uint32_t ISR;           /*!< LTDC Interrupt Status Register,                      Address offset: 0x38  */
  __IO uint32_t ICR;           /*!< LTDC Interrupt Clear Register,                       Address offset: 0x3C  */
  __IO uint32_t LIPCR;         /*!< LTDC Line Interrupt Position Configuration Register, Address offset: 0x40  */
  __IO uint32_t CPSR;          /*!< LTDC Current Position Status Register,               Address offset: 0x44  */
  __IO uint32_t CDSR;          /*!< LTDC Current Display Status Register,                 Address offset: 0x48 */
} LTDC_TypeDef;

/**
  * @brief LCD-TFT Display layer x Controller
  */

typedef struct
{
  __IO uint32_t CR;            /*!< LTDC Layerx Control Register                                  Address offset: 0x84 */
  __IO uint32_t WHPCR;         /*!< LTDC Layerx Window Horizontal Position Configuration Register Address offset: 0x88 */
  __IO uint32_t WVPCR;         /*!< LTDC Layerx Window Vertical Position Configuration Register   Address offset: 0x8C */
  __IO uint32_t CKCR;          /*!< LTDC Layerx Color Keying Configuration Register               Address offset: 0x90 */
  __IO uint32_t PFCR;          /*!< LTDC Layerx Pixel Format Configuration Register               Address offset: 0x94 */
  __IO uint32_t CACR;          /*!< LTDC Layerx Constant Alpha Configuration Register             Address offset: 0x98 */
  __IO uint32_t DCCR;          /*!< LTDC Layerx Default Color Configuration Register              Address offset: 0x9C */
  __IO uint32_t BFCR;          /*!< LTDC Layerx Blending Factors Configuration Register           Address offset: 0xA0 */
  uint32_t      RESERVED0[2];  /*!< Reserved */
  __IO uint32_t CFBAR;         /*!< LTDC Layerx Color Frame Buffer Address Register               Address offset: 0xAC */
  __IO uint32_t CFBLR;         /*!< LTDC Layerx Color Frame Buffer Length Register                Address offset: 0xB0 */
  __IO uint32_t CFBLNR;        /*!< LTDC Layerx ColorFrame Buffer Line Number Register            Address offset: 0xB4 */
  uint32_t      RESERVED1[3];  /*!< Reserved */
  __IO uint32_t CLUTWR;        /*!< LTDC Layerx CLUT Write Register                               Address offset: 0x144 */

} LTDC_Layer_TypeDef;


/**
  * @brief GFXTIM
  */
typedef struct
{
  __IO uint32_t CR;            /*!< GFXTIM configuration register,                    Address offset: 0x00 */
  __IO uint32_t CGCR;          /*!< GFXTIM clock generator configuration register,    Address offset: 0x04 */
  __IO uint32_t TCR;           /*!< GFXTIM timers configuration register,             Address offset: 0x08 */
  __IO uint32_t TDR;           /*!< GFXTIM timers disable register,                   Address offset: 0x0C */
  __IO uint32_t EVCR;          /*!< GFXTIM events control register,                   Address offset: 0x10 */
  __IO uint32_t EVSR;          /*!< GFXTIM events selection register,                 Address offset: 0x14 */
  uint32_t RESERVED1[2];       /*!< Reserved,                                         Address offset: 0x18-0x1C */
  __IO uint32_t WDGTCR;        /*!< GFXTIM watchdog timer configuration register,     Address offset: 0x20 */
  uint32_t RESERVED2[3];       /*!< Reserved,                                         Address offset: 0x24-0x2C */
  __IO uint32_t ISR;           /*!< GFXTIM interrupt status register,                 Address offset: 0x30 */
  __IO uint32_t ICR;           /*!< GFXTIM interrupt clear register,                  Address offset: 0x34 */
  __IO uint32_t IER;           /*!< GFXTIM interrupt enable register,                 Address offset: 0x38 */
  __IO uint32_t TSR;           /*!< GFXTIM timers status register,                    Address offset: 0x3C */
  __IO uint32_t LCCRR;         /*!< GFXTIM line clock counter reload register,        Address offset: 0x40 */
  __IO uint32_t FCCRR;         /*!< GFXTIM frame clock counter reload register,       Address offset: 0x44 */
  uint32_t RESERVED3[2];       /*!< Reserved,                                         Address offset: 0x48-0x4C */
  __IO uint32_t ATR;           /*!< GFXTIM absolute time register,                    Address offset: 0x50 */
  __IO uint32_t AFCR;          /*!< GFXTIM absolute frame counter register,           Address offset: 0x54 */
  __IO uint32_t ALCR;          /*!< GFXTIM absolute line counter register,            Address offset: 0x58 */
  uint32_t RESERVED4[1];       /*!< Reserved,                                         Address offset: 0x5C */
  __IO uint32_t AFCC1R;        /*!< GFXTIM absolute frame counter compare 1 register, Address offset: 0x60 */
  uint32_t RESERVED5[3];       /*!< Reserved,                                         Address offset: 0x64-0X6C */
  __IO uint32_t ALCC1R;        /*!< GFXTIM absolute line counter compare 1 register,  Address offset: 0x70 */
  __IO uint32_t ALCC2R;        /*!< GFXTIM absolute line counter compare 2 register,  Address offset: 0x74 */
  uint32_t RESERVED6[2];       /*!< Reserved,                                         Address offset: 0x78-0X7C */
  __IO uint32_t RFC1R;         /*!< GFXTIM relative frame counter 1 register,         Address offset: 0x80 */
  __IO uint32_t RFC1RR;        /*!< GFXTIM relative frame counter 1 reload register,  Address offset: 0x84 */
  __IO uint32_t RFC2R;         /*!< GFXTIM relative frame counter 2 register,         Address offset: 0x88 */
  __IO uint32_t RFC2RR;        /*!< GFXTIM relative frame counter 2 reload register,  Address offset: 0x8C */
  uint32_t RESERVED7[4];       /*!< Reserved,                                         Address offset: 0x90-0X9C */
  __IO uint32_t WDGCR;         /*!< GFXTIM watchdog counter register,                 Address offset: 0xA0 */
  __IO uint32_t WDGRR;         /*!< GFXTIM watchdog reload register,                  Address offset: 0xA4 */
  __IO uint32_t WDGPAR;        /*!< GFXTIM watchdog pre-alarm register,               Address offset: 0xA8 */
  uint32_t RESERVED8[209];     /*!< Reserved,                                         Address offset: 0xAC-0X3EC */
  __IO uint32_t HWCFGR;        /*!< GFXTIM HW configuration register,                 Address offset: 0x3F0 */
  __IO uint32_t VERR;          /*!< GFXTIM version register,                          Address offset: 0x3F4 */
  __IO uint32_t IPIDR;         /*!< GFXTIM identification register,                   Address offset: 0x3F8 */
  __IO uint32_t SIDR;          /*!< GFXTIM size identification register,              Address offset: 0x3FC */
} GFXTIM_TypeDef;

/**
  * @brief JPEG Codec
  */
typedef struct
{
  __IO uint32_t CONFR0;          /*!< JPEG Codec Control Register (JPEG_CONFR0),        Address offset: 00h       */
  __IO uint32_t CONFR1;          /*!< JPEG Codec Control Register (JPEG_CONFR1),        Address offset: 04h       */
  __IO uint32_t CONFR2;          /*!< JPEG Codec Control Register (JPEG_CONFR2),        Address offset: 08h       */
  __IO uint32_t CONFR3;          /*!< JPEG Codec Control Register (JPEG_CONFR3),        Address offset: 0Ch       */
  __IO uint32_t CONFR4;          /*!< JPEG Codec Control Register (JPEG_CONFR4),        Address offset: 10h       */
  __IO uint32_t CONFR5;          /*!< JPEG Codec Control Register (JPEG_CONFR5),        Address offset: 14h       */
  __IO uint32_t CONFR6;          /*!< JPEG Codec Control Register (JPEG_CONFR6),        Address offset: 18h       */
  __IO uint32_t CONFR7;          /*!< JPEG Codec Control Register (JPEG_CONFR7),        Address offset: 1Ch       */
  uint32_t  Reserved20[4];       /* Reserved                                            Address offset: 20h-2Ch   */
  __IO uint32_t CR;              /*!< JPEG Control Register (JPEG_CR),                  Address offset: 30h       */
  __IO uint32_t SR;              /*!< JPEG Status Register (JPEG_SR),                   Address offset: 34h       */
  __IO uint32_t CFR;             /*!< JPEG Clear Flag Register (JPEG_CFR),              Address offset: 38h       */
  uint32_t  Reserved3c;          /* Reserved                                            Address offset: 3Ch       */
  __IO uint32_t DIR;             /*!< JPEG Data Input Register (JPEG_DIR),              Address offset: 40h       */
  __IO uint32_t DOR;             /*!< JPEG Data Output Register (JPEG_DOR),             Address offset: 44h       */
  uint32_t  Reserved48[2];       /* Reserved                                            Address offset: 48h-4Ch   */
  __IO uint32_t QMEM0[16];       /*!< JPEG quantization tables 0,                       Address offset: 50h-8Ch   */
  __IO uint32_t QMEM1[16];       /*!< JPEG quantization tables 1,                       Address offset: 90h-CCh   */
  __IO uint32_t QMEM2[16];       /*!< JPEG quantization tables 2,                       Address offset: D0h-10Ch  */
  __IO uint32_t QMEM3[16];       /*!< JPEG quantization tables 3,                       Address offset: 110h-14Ch */
  __IO uint32_t HUFFMIN[16];     /*!< JPEG HuffMin tables,                              Address offset: 150h-18Ch */
  __IO uint32_t HUFFBASE[32];    /*!< JPEG HuffSymb tables,                             Address offset: 190h-20Ch */
  __IO uint32_t HUFFSYMB[84];    /*!< JPEG HUFFSYMB tables,                             Address offset: 210h-35Ch */
  __IO uint32_t DHTMEM[103];     /*!< JPEG DHTMem tables,                               Address offset: 360h-4F8h */
  uint32_t  Reserved4FC;         /* Reserved                                            Address offset: 4FCh      */
  __IO uint32_t HUFFENC_AC0[88]; /*!< JPEG encodor, AC Huffman table 0,                 Address offset: 500h-65Ch */
  __IO uint32_t HUFFENC_AC1[88]; /*!< JPEG encodor, AC Huffman table 1,                 Address offset: 660h-7BCh */
  __IO uint32_t HUFFENC_DC0[8];  /*!< JPEG encodor, DC Huffman table 0,                 Address offset: 7C0h-7DCh */
  __IO uint32_t HUFFENC_DC1[8];  /*!< JPEG encodor, DC Huffman table 1,                 Address offset: 7E0h-7FCh */

} JPEG_TypeDef;

