zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5e5xx.h
/********************  Bit definition for DMA2D_NLR register  *****************/
#define DMA2D_NLR_NL_Pos                    (0U)
#define DMA2D_NLR_NL_Msk                    (0xFFFFUL << DMA2D_NLR_NL_Pos)          /*!< 0x0000FFFF */
#define DMA2D_NLR_NL                        DMA2D_NLR_NL_Msk                        /*!< Number of Lines */
#define DMA2D_NLR_PL_Pos                    (16U)
#define DMA2D_NLR_PL_Msk                    (0x3FFFUL << DMA2D_NLR_PL_Pos)          /*!< 0x3FFF0000 */
#define DMA2D_NLR_PL                        DMA2D_NLR_PL_Msk                        /*!< Pixel per Lines */

/********************  Bit definition for DMA2D_LWR register  *****************/
#define DMA2D_LWR_LW_Pos                    (0U)
#define DMA2D_LWR_LW_Msk                    (0xFFFFUL << DMA2D_LWR_LW_Pos)          /*!< 0x0000FFFF */
#define DMA2D_LWR_LW                        DMA2D_LWR_LW_Msk                        /*!< Line Watermark */

/********************  Bit definition for DMA2D_AMTCR register  ***************/
#define DMA2D_AMTCR_EN_Pos                  (0U)
#define DMA2D_AMTCR_EN_Msk                  (0x1UL << DMA2D_AMTCR_EN_Pos)           /*!< 0x00000001 */
#define DMA2D_AMTCR_EN                      DMA2D_AMTCR_EN_Msk                      /*!< Enable */
#define DMA2D_AMTCR_DT_Pos                  (8U)
#define DMA2D_AMTCR_DT_Msk                  (0xFFUL << DMA2D_AMTCR_DT_Pos)          /*!< 0x0000FF00 */
#define DMA2D_AMTCR_DT                      DMA2D_AMTCR_DT_Msk                      /*!< Dead Time */

/******************  Bit definition for DMA2D_SBCR register  ******************/
#define DMA2D_SBCR_SRC_Pos             (0U)
#define DMA2D_SBCR_SRC_Msk             (0x3UL << DMA2D_SBCR_SRC_Pos) /*!< 0x00000003 */
#define DMA2D_SBCR_SRC                 DMA2D_SBCR_SRC_Msk           /*!< Source */
#define DMA2D_SBCR_MODE_Pos            (4U)
#define DMA2D_SBCR_MODE_Msk            (0x3UL << DMA2D_SBCR_MODE_Pos) /*!< 0x00000030 */
#define DMA2D_SBCR_MODE                DMA2D_SBCR_MODE_Msk          /*!< Mode */
#define DMA2D_SBCR_AI_Pos              (20U)
#define DMA2D_SBCR_AI_Msk              (0x1UL << DMA2D_SBCR_AI_Pos)  /*!< 0x00100000 */
#define DMA2D_SBCR_AI                  DMA2D_SBCR_AI_Msk            /*!< Alpha Inverted */

/*****************  Bit definition for DMA2D_SBMAR register  ******************/
#define DMA2D_SBMAR_MA_Pos             (0U)
#define DMA2D_SBMAR_MA_Msk             (0xFFFFFFFFU << DMA2D_SBMAR_MA_Pos)       /*!< 0xFFFFFFFF */
#define DMA2D_SBMAR_MA                 DMA2D_SBMAR_MA_Msk          /*!< Memory address, address of the data used for the stencil buffer */

/******************  Bit definition for DMA2D_SBOR register  ******************/
#define DMA2D_SBOR_LO_Pos              (0U)
#define DMA2D_SBOR_LO_Msk              (0xFFFFU << DMA2D_SBOR_LO_Pos)  /*!< 0x0000FFFF */
#define DMA2D_SBOR_LO                  DMA2D_SBOR_LO_Msk           /*!< Line offset */

/*****************  Bit definition for DMA2D_SBMSR register  ******************/
#define DMA2D_SBMSR_HPRE_Pos           (0U)
#define DMA2D_SBMSR_HPRE_Msk           (0xFUL << DMA2D_SBMSR_HPRE_Pos)  /*!< 0x0000000F */
#define DMA2D_SBMSR_HPRE               DMA2D_SBMSR_HPRE_Msk        /*!< Horizontal pre pixels */
#define DMA2D_SBMSR_HTRAIL_Pos         (8U)
#define DMA2D_SBMSR_HTRAIL_Msk         (0xFUL << DMA2D_SBMSR_HTRAIL_Pos)    /*!< 0x00000F00 */
#define DMA2D_SBMSR_HTRAIL             DMA2D_SBMSR_HTRAIL_Msk      /*!< Horizontal trailing pixels */

/******************  Bit definition for DMA2D_TBCR register  ******************/
#define DMA2D_TBCR_SRC_Pos             (0U)
#define DMA2D_TBCR_SRC_Msk             (0x3U << DMA2D_TBCR_SRC_Pos)/*!< 0x00000003 */
#define DMA2D_TBCR_SRC                 DMA2D_TBCR_SRC_Msk          /*!< Source */
#define DMA2D_TBCR_XMEN_Pos            (4U)
#define DMA2D_TBCR_XMEN_Msk            (0x1U << DMA2D_TBCR_XMEN_Pos) /*!< 0x00000010 */
#define DMA2D_TBCR_XMEN                DMA2D_TBCR_XMEN_Msk         /*!< X mirroring enable */
#define DMA2D_TBCR_YMEN_Pos            (5U)
#define DMA2D_TBCR_YMEN_Msk            (0x1U << DMA2D_TBCR_YMEN_Pos) /*!< 0x00000020 */
#define DMA2D_TBCR_YMEN                DMA2D_TBCR_YMEN_Msk         /*!< Y mirroring enable */
#define DMA2D_TBCR_XYSEN_Pos           (6U)
#define DMA2D_TBCR_XYSEN_Msk           (0x1U << DMA2D_TBCR_XYSEN_Pos)  /*!< 0x00000040 */
#define DMA2D_TBCR_XYSEN               DMA2D_TBCR_XYSEN_Msk        /*!< X/Y swap enable */

/******************  Bit definition for DMA2D_SCR register  *******************/
#define DMA2D_SCR_SRC_Pos              (0U)
#define DMA2D_SCR_SRC_Msk              (0x3U << DMA2D_SCR_SRC_Pos) /*!< 0x00000003 */
#define DMA2D_SCR_SRC                  DMA2D_SCR_SRC_Msk           /*!< Source */

/******************  Bit definition for DMA2D_SNLR register  ******************/
#define DMA2D_SNLR_NL_Pos              (0U)
#define DMA2D_SNLR_NL_Msk              (0xFFFFU << DMA2D_SNLR_NL_Pos)  /*!< 0x0000FFFF */
#define DMA2D_SNLR_NL                  DMA2D_SNLR_NL_Msk           /*!< Number of lines */
#define DMA2D_SNLR_PL_Pos              (16U)
#define DMA2D_SNLR_PL_Msk              (0x3FFFU << DMA2D_SNLR_PL_Pos)  /*!< 0x3FFF0000 */
#define DMA2D_SNLR_PL                  DMA2D_SNLR_PL_Msk           /*!< Pixel per lines */

/******************  Bit definition for DMA2D_SSR register  *******************/
#define DMA2D_SSR_HSTEP_Pos            (0U)
#define DMA2D_SSR_HSTEP_Msk            (0xFFFUL << DMA2D_SSR_HSTEP_Pos)   /*!< 0x00000FFF */
#define DMA2D_SSR_HSTEP                DMA2D_SSR_HSTEP_Msk         /*!< horizontal step */
#define DMA2D_SSR_VSTEP_Pos            (16U)
#define DMA2D_SSR_VSTEP_Msk            (0xFFFUL << DMA2D_SSR_VSTEP_Pos)   /*!< 0x0FFF0000 */
#define DMA2D_SSR_VSTEP                DMA2D_SSR_VSTEP_Msk         /*!< vertical step */

/******************  Bit definition for DMA2D_SPR register  *******************/
#define DMA2D_SPR_HPHASE_Pos           (0U)
#define DMA2D_SPR_HPHASE_Msk           (0xFFFU << DMA2D_SPR_HPHASE_Pos)    /*!< 0x00000FFF */
#define DMA2D_SPR_HPHASE               DMA2D_SPR_HPHASE_Msk        /*!< horizontal phase */
#define DMA2D_SPR_VPHASE_Pos           (16U)
#define DMA2D_SPR_VPHASE_Msk           (0xFFFU << DMA2D_SPR_VPHASE_Pos)    /*!< 0x0FFF0000 */
#define DMA2D_SPR_VPHASE               DMA2D_SPR_VPHASE_Msk        /*!< vertical phase */

/*****************  Bit definition for DMA2D_GPFCR register  ******************/
#define DMA2D_GPFCR_GPF0IC_Pos         (0U)
#define DMA2D_GPFCR_GPF0IC_Msk         (0x3U << DMA2D_GPFCR_GPF0IC_Pos)    /*!< 0x00000003 */
#define DMA2D_GPFCR_GPF0IC             DMA2D_GPFCR_GPF0IC_Msk      /*!< General purpose flag 0 interrupt configuration */
#define DMA2D_GPFCR_GPF1IC_Pos         (2U)
#define DMA2D_GPFCR_GPF1IC_Msk         (0x3U << DMA2D_GPFCR_GPF1IC_Pos)    /*!< 0x0000000C */
#define DMA2D_GPFCR_GPF1IC             DMA2D_GPFCR_GPF1IC_Msk      /*!< General purpose flag 1 interrupt configuration */
#define DMA2D_GPFCR_GPF2IC_Pos         (4U)
#define DMA2D_GPFCR_GPF2IC_Msk         (0x3U << DMA2D_GPFCR_GPF2IC_Pos)    /*!< 0x00000030 */
#define DMA2D_GPFCR_GPF2IC             DMA2D_GPFCR_GPF2IC_Msk      /*!< General purpose flag 2 interrupt configuration */
#define DMA2D_GPFCR_GPF3IC_Pos         (6U)
#define DMA2D_GPFCR_GPF3IC_Msk         (0x3U << DMA2D_GPFCR_GPF3IC_Pos)    /*!< 0x000000C0 */
#define DMA2D_GPFCR_GPF3IC             DMA2D_GPFCR_GPF3IC_Msk      /*!< General purpose flag 3 interrupt configuration */
#define DMA2D_GPFCR_GPF0SC_Pos         (16U)
#define DMA2D_GPFCR_GPF0SC_Msk         (0x1U << DMA2D_GPFCR_GPF0SC_Pos)    /*!< 0x00010000 */
#define DMA2D_GPFCR_GPF0SC             DMA2D_GPFCR_GPF0SC_Msk      /*!< General purpose flag 0 suspend configuration */
#define DMA2D_GPFCR_GPF1SC_Pos         (17U)
#define DMA2D_GPFCR_GPF1SC_Msk         (0x1U << DMA2D_GPFCR_GPF1SC_Pos)    /*!< 0x00020000 */
#define DMA2D_GPFCR_GPF1SC             DMA2D_GPFCR_GPF1SC_Msk      /*!< General purpose flag 1 suspend configuration */
#define DMA2D_GPFCR_GPF2SC_Pos         (18U)
#define DMA2D_GPFCR_GPF2SC_Msk         (0x1U << DMA2D_GPFCR_GPF2SC_Pos)    /*!< 0x00040000 */
#define DMA2D_GPFCR_GPF2SC             DMA2D_GPFCR_GPF2SC_Msk      /*!< General purpose flag 2 suspend configuration */
#define DMA2D_GPFCR_GPF3SC_Pos         (19U)
#define DMA2D_GPFCR_GPF3SC_Msk         (0x1U << DMA2D_GPFCR_GPF3SC_Pos)    /*!< 0x00080000 */
#define DMA2D_GPFCR_GPF3SC             DMA2D_GPFCR_GPF3SC_Msk      /*!< General purpose flag 3 suspend configuration */

/******************  Bit definition for DMA2D_GPFR register  ******************/
#define DMA2D_GPFR_GPF0_Pos            (0U)
#define DMA2D_GPFR_GPF0_Msk            (0x1U << DMA2D_GPFR_GPF0_Pos) /*!< 0x00000001 */
#define DMA2D_GPFR_GPF0                DMA2D_GPFR_GPF0_Msk         /*!< General purpose flag 0 */
#define DMA2D_GPFR_GPF1_Pos            (1U)
#define DMA2D_GPFR_GPF1_Msk            (0x1U << DMA2D_GPFR_GPF1_Pos) /*!< 0x00000002 */
#define DMA2D_GPFR_GPF1                DMA2D_GPFR_GPF1_Msk         /*!< General purpose flag 1 */
#define DMA2D_GPFR_GPF2_Pos            (2U)
#define DMA2D_GPFR_GPF2_Msk            (0x1U << DMA2D_GPFR_GPF2_Pos) /*!< 0x00000004 */
#define DMA2D_GPFR_GPF2                DMA2D_GPFR_GPF2_Msk         /*!< General purpose flag 2 */
#define DMA2D_GPFR_GPF3_Pos            (3U)
#define DMA2D_GPFR_GPF3_Msk            (0x1U << DMA2D_GPFR_GPF3_Pos) /*!< 0x00000008 */
#define DMA2D_GPFR_GPF3                DMA2D_GPFR_GPF3_Msk         /*!< General purpose flag 3 */

/*****************  Bit definition for DMA2D_GPFSR register  ******************/
#define DMA2D_GPFSR_SGPF0_Pos          (0U)
#define DMA2D_GPFSR_SGPF0_Msk          (0x1U << DMA2D_GPFSR_SGPF0_Pos)   /*!< 0x00000001 */
#define DMA2D_GPFSR_SGPF0              DMA2D_GPFSR_SGPF0_Msk       /*!< Set general purpose flag 0 */
#define DMA2D_GPFSR_SGPF1_Pos          (1U)
#define DMA2D_GPFSR_SGPF1_Msk          (0x1U << DMA2D_GPFSR_SGPF1_Pos)   /*!< 0x00000002 */
#define DMA2D_GPFSR_SGPF1              DMA2D_GPFSR_SGPF1_Msk       /*!< Set general purpose flag 1 */
#define DMA2D_GPFSR_SGPF2_Pos          (2U)
#define DMA2D_GPFSR_SGPF2_Msk          (0x1U << DMA2D_GPFSR_SGPF2_Pos)   /*!< 0x00000004 */
#define DMA2D_GPFSR_SGPF2              DMA2D_GPFSR_SGPF2_Msk       /*!< Set general purpose flag 2 */
#define DMA2D_GPFSR_SGPF3_Pos          (3U)
#define DMA2D_GPFSR_SGPF3_Msk          (0x1U << DMA2D_GPFSR_SGPF3_Pos)   /*!< 0x00000008 */
#define DMA2D_GPFSR_SGPF3              DMA2D_GPFSR_SGPF3_Msk       /*!< Set general purpose flag 3 */

/*****************  Bit definition for DMA2D_GPFRR register  ******************/
#define DMA2D_GPFRR_RGPF0_Pos          (0U)
#define DMA2D_GPFRR_RGPF0_Msk          (0x1U << DMA2D_GPFRR_RGPF0_Pos)   /*!< 0x00000001 */
#define DMA2D_GPFRR_RGPF0              DMA2D_GPFRR_RGPF0_Msk       /*!< Reset general purpose flag 0 */
#define DMA2D_GPFRR_RGPF1_Pos          (1U)
#define DMA2D_GPFRR_RGPF1_Msk          (0x1U << DMA2D_GPFRR_RGPF1_Pos)   /*!< 0x00000002 */
#define DMA2D_GPFRR_RGPF1              DMA2D_GPFRR_RGPF1_Msk       /*!< Reset general purpose flag 1 */
#define DMA2D_GPFRR_RGPF2_Pos          (2U)
#define DMA2D_GPFRR_RGPF2_Msk          (0x1U << DMA2D_GPFRR_RGPF2_Pos)   /*!< 0x00000004 */
#define DMA2D_GPFRR_RGPF2              DMA2D_GPFRR_RGPF2_Msk       /*!< Reset general purpose flag 2 */
#define DMA2D_GPFRR_RGPF3_Pos          (3U)
#define DMA2D_GPFRR_RGPF3_Msk          (0x1U << DMA2D_GPFRR_RGPF3_Pos)   /*!< 0x00000008 */
#define DMA2D_GPFRR_RGPF3              DMA2D_GPFRR_RGPF3_Msk       /*!< Reset general purpose flag 3 */

/******************  Bit definition for DMA2D_CLCR register  ******************/
#define DMA2D_CLCR_START_Pos           (0U)
#define DMA2D_CLCR_START_Msk           (0x1U << DMA2D_CLCR_START_Pos)  /*!< 0x00000001 */
#define DMA2D_CLCR_START               DMA2D_CLCR_START_Msk        /*!< Start */
#define DMA2D_CLCR_SUSP_Pos            (1U)
#define DMA2D_CLCR_SUSP_Msk            (0x1U << DMA2D_CLCR_SUSP_Pos) /*!< 0x00000002 */
#define DMA2D_CLCR_SUSP                DMA2D_CLCR_SUSP_Msk         /*!< Suspend */
#define DMA2D_CLCR_ABORT_Pos           (2U)
#define DMA2D_CLCR_ABORT_Msk           (0x1U << DMA2D_CLCR_ABORT_Pos)  /*!< 0x00000004 */
#define DMA2D_CLCR_ABORT               DMA2D_CLCR_ABORT_Msk        /*!< Abort */
#define DMA2D_CLCR_RBS_Pos             (4U)
#define DMA2D_CLCR_RBS_Msk             (0x7U << DMA2D_CLCR_RBS_Pos)/*!< 0x00000070 */
#define DMA2D_CLCR_RBS                 DMA2D_CLCR_RBS_Msk          /*!< Ring buffer size */

/******************  Bit definition for DMA2D_CLSR register  ******************/
#define DMA2D_CLSR_SUSPS_Pos           (0U)
#define DMA2D_CLSR_SUSPS_Msk           (0x1U << DMA2D_CLSR_SUSPS_Pos)  /*!< 0x00000001 */
#define DMA2D_CLSR_SUSPS               DMA2D_CLSR_SUSPS_Msk        /*!< SUSP bit suspend */
#define DMA2D_CLSR_GPF0S_Pos           (1U)
#define DMA2D_CLSR_GPF0S_Msk           (0x1U << DMA2D_CLSR_GPF0S_Pos)  /*!< 0x00000002 */
#define DMA2D_CLSR_GPF0S               DMA2D_CLSR_GPF0S_Msk        /*!< General purpose flag 0 suspend */
#define DMA2D_CLSR_GPF1S_Pos           (2U)
#define DMA2D_CLSR_GPF1S_Msk           (0x1U << DMA2D_CLSR_GPF1S_Pos)  /*!< 0x00000004 */
#define DMA2D_CLSR_GPF1S               DMA2D_CLSR_GPF1S_Msk        /*!< General purpose flag 1 suspend */
#define DMA2D_CLSR_GPF2S_Pos           (3U)
#define DMA2D_CLSR_GPF2S_Msk           (0x1U << DMA2D_CLSR_GPF2S_Pos)  /*!< 0x00000008 */
#define DMA2D_CLSR_GPF2S               DMA2D_CLSR_GPF2S_Msk        /*!< General purpose flag 2 suspend */
#define DMA2D_CLSR_GPF3S_Pos           (4U)
#define DMA2D_CLSR_GPF3S_Msk           (0x1U << DMA2D_CLSR_GPF3S_Pos)  /*!< 0x00000010 */
#define DMA2D_CLSR_GPF3S               DMA2D_CLSR_GPF3S_Msk        /*!< General purpose flag 3 suspend */
#define DMA2D_CLSR_LCLRE_Pos           (8U)
#define DMA2D_CLSR_LCLRE_Msk           (0x1U << DMA2D_CLSR_LCLRE_Pos)  /*!< 0x00000100 */
#define DMA2D_CLSR_LCLRE               DMA2D_CLSR_LCLRE_Msk        /*!< Linear command list read error */
#define DMA2D_CLSR_LCLIE_Pos           (9U)
#define DMA2D_CLSR_LCLIE_Msk           (0x1U << DMA2D_CLSR_LCLIE_Pos)  /*!< 0x00000200 */
#define DMA2D_CLSR_LCLIE               DMA2D_CLSR_LCLIE_Msk        /*!< Linear command list instruction error */
#define DMA2D_CLSR_LCLMSE_Pos          (10U)
#define DMA2D_CLSR_LCLMSE_Msk          (0x1U << DMA2D_CLSR_LCLMSE_Pos)   /*!< 0x00000400 */
#define DMA2D_CLSR_LCLMSE              DMA2D_CLSR_LCLMSE_Msk       /*!< Linear command list multiple start error */

/*****************  Bit definition for DMA2D_RBBAR register  ******************/
#define DMA2D_RBBAR_ADDRESS_Pos        (0U)
#define DMA2D_RBBAR_ADDRESS_Msk        (0xFFFFFFFFU << DMA2D_RBBAR_ADDRESS_Pos)            /*!< 0xFFFFFFFF */
#define DMA2D_RBBAR_ADDRESS            DMA2D_RBBAR_ADDRESS_Msk     /*!< Address */

/*****************  Bit definition for DMA2D_RBHPR register  ******************/
#define DMA2D_RBHPR_HP_Pos             (0U)
#define DMA2D_RBHPR_HP_Msk             (0x3FFFU << DMA2D_RBHPR_HP_Pos)   /*!< 0x00003FFF */
#define DMA2D_RBHPR_HP                 DMA2D_RBHPR_HP_Msk          /*!< Head Pointer */

/*****************  Bit definition for DMA2D_RBWPR register  ******************/
#define DMA2D_RBWPR_WP_Pos             (0U)
#define DMA2D_RBWPR_WP_Msk             (0x3FFFU << DMA2D_RBWPR_WP_Pos)   /*!< 0x00003FFF */
#define DMA2D_RBWPR_WP                 DMA2D_RBWPR_WP_Msk          /*!< Write Pointer */

