zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5e5xx.h
#define RCC_CCIPR3_LPUART1SEL_Pos           (24UL)
#define RCC_CCIPR3_LPUART1SEL_Msk           (0x7UL << RCC_CCIPR3_LPUART1SEL_Pos)    /*!< 0x07000000 */
#define RCC_CCIPR3_LPUART1SEL               RCC_CCIPR3_LPUART1SEL_Msk
#define RCC_CCIPR3_LPUART1SEL_0             (0x1UL << RCC_CCIPR3_LPUART1SEL_Pos)    /*!< 0x01000000 */
#define RCC_CCIPR3_LPUART1SEL_1             (0x2UL << RCC_CCIPR3_LPUART1SEL_Pos)    /*!< 0x02000000 */
#define RCC_CCIPR3_LPUART1SEL_2             (0x4UL << RCC_CCIPR3_LPUART1SEL_Pos)    /*!< 0x04000000 */

#define RCC_CCIPR3_PLAY1SEL_Pos             (29UL)
#define RCC_CCIPR3_PLAY1SEL_Msk             (0x7UL << RCC_CCIPR3_PLAY1SEL_Pos)      /*!< 0xE0000000 */
#define RCC_CCIPR3_PLAY1SEL                 RCC_CCIPR3_PLAY1SEL_Msk
#define RCC_CCIPR3_PLAY1SEL_0               (0x1UL << RCC_CCIPR3_PLAY1SEL_Pos)      /*!< 0x20000000 */
#define RCC_CCIPR3_PLAY1SEL_1               (0x2UL << RCC_CCIPR3_PLAY1SEL_Pos)      /*!< 0x40000000 */
#define RCC_CCIPR3_PLAY1SEL_2               (0x4UL << RCC_CCIPR3_PLAY1SEL_Pos)      /*!< 0x80000000 */

/********************  Bit definition for RCC_CCIPR4 register  ***************/

#define RCC_CCIPR4_OCTOSPISEL_Pos           (0UL)
#define RCC_CCIPR4_OCTOSPISEL_Msk           (0x3UL << RCC_CCIPR4_OCTOSPISEL_Pos)    /*!< 0x00000003 */
#define RCC_CCIPR4_OCTOSPISEL               RCC_CCIPR4_OCTOSPISEL_Msk
#define RCC_CCIPR4_OCTOSPISEL_0             (0x1UL << RCC_CCIPR4_OCTOSPISEL_Pos)    /*!< 0x00000001 */
#define RCC_CCIPR4_OCTOSPISEL_1             (0x2UL << RCC_CCIPR4_OCTOSPISEL_Pos)    /*!< 0x00000002 */

#define RCC_CCIPR4_SYSTICKSEL_Pos           (2UL)
#define RCC_CCIPR4_SYSTICKSEL_Msk           (0x3UL << RCC_CCIPR4_SYSTICKSEL_Pos)    /*!< 0x0000000C */
#define RCC_CCIPR4_SYSTICKSEL               RCC_CCIPR4_SYSTICKSEL_Msk
#define RCC_CCIPR4_SYSTICKSEL_0             (0x1UL << RCC_CCIPR4_SYSTICKSEL_Pos)    /*!< 0x00000004 */
#define RCC_CCIPR4_SYSTICKSEL_1             (0x2UL << RCC_CCIPR4_SYSTICKSEL_Pos)    /*!< 0x00000008 */

#define RCC_CCIPR4_OTGFSSEL_Pos             (4UL)
#define RCC_CCIPR4_OTGFSSEL_Msk             (0x3UL << RCC_CCIPR4_OTGFSSEL_Pos)        /*!< 0x00000030 */
#define RCC_CCIPR4_OTGFSSEL                 RCC_CCIPR4_OTGFSSEL_Msk
#define RCC_CCIPR4_OTGFSSEL_0               (0x1UL << RCC_CCIPR4_OTGFSSEL_Pos)        /*!< 0x00000010 */
#define RCC_CCIPR4_OTGFSSEL_1               (0x2UL << RCC_CCIPR4_OTGFSSEL_Pos)        /*!< 0x00000020 */

#define RCC_CCIPR4_SDMMC1SEL_Pos            (6UL)
#define RCC_CCIPR4_SDMMC1SEL_Msk            (0x1UL << RCC_CCIPR4_SDMMC1SEL_Pos)     /*!< 0x00000040 */
#define RCC_CCIPR4_SDMMC1SEL                RCC_CCIPR4_SDMMC1SEL_Msk

#define RCC_CCIPR4_SDMMC2SEL_Pos            (7UL)
#define RCC_CCIPR4_SDMMC2SEL_Msk            (0x1UL << RCC_CCIPR4_SDMMC2SEL_Pos)     /*!< 0x00000080 */
#define RCC_CCIPR4_SDMMC2SEL                RCC_CCIPR4_SDMMC2SEL_Msk
#define RCC_CCIPR4_ETHCLKSEL_Pos            (8UL)
#define RCC_CCIPR4_ETHCLKSEL_Msk            (0x1UL << RCC_CCIPR4_ETHCLKSEL_Pos)     /*!< 0x00000100 */
#define RCC_CCIPR4_ETHCLKSEL                RCC_CCIPR4_ETHCLKSEL_Msk
#define RCC_CCIPR4_OTGPDCTRL_Pos            (9UL)
#define RCC_CCIPR4_OTGPDCTRL_Msk            (0x1UL << RCC_CCIPR4_OTGPDCTRL_Pos)     /*!< 0x00000200 */
#define RCC_CCIPR4_OTGPDCTRL                RCC_CCIPR4_OTGPDCTRL_Msk
#define RCC_CCIPR4_OTGHSSEL_Pos             (10UL)
#define RCC_CCIPR4_OTGHSSEL_Msk             (0x3UL << RCC_CCIPR4_OTGHSSEL_Pos)      /*!< 0x00000C00 */
#define RCC_CCIPR4_OTGHSSEL                 RCC_CCIPR4_OTGHSSEL_Msk
#define RCC_CCIPR4_OTGHSSEL_0               (0x1UL << RCC_CCIPR4_OTGHSSEL_Pos)      /*!< 0x00000400 */
#define RCC_CCIPR4_OTGHSSEL_1               (0x2UL << RCC_CCIPR4_OTGHSSEL_Pos)      /*!< 0x00000800 */
#define RCC_CCIPR4_OTGPHYREFCKSEL_Pos       (12UL)
#define RCC_CCIPR4_OTGPHYREFCKSEL_Msk       (0xFUL << RCC_CCIPR4_OTGPHYREFCKSEL_Pos) /*!< 0x0000F000 */
#define RCC_CCIPR4_OTGPHYREFCKSEL           RCC_CCIPR4_OTGPHYREFCKSEL_Msk
#define RCC_CCIPR4_OTGPHYREFCKSEL_0         (0x1UL << RCC_CCIPR4_OTGPHYREFCKSEL_Pos) /*!< 0x00001000 */
#define RCC_CCIPR4_OTGPHYREFCKSEL_1         (0x2UL << RCC_CCIPR4_OTGPHYREFCKSEL_Pos) /*!< 0x00002000 */
#define RCC_CCIPR4_OTGPHYREFCKSEL_2         (0x4UL << RCC_CCIPR4_OTGPHYREFCKSEL_Pos) /*!< 0x00004000 */
#define RCC_CCIPR4_OTGPHYREFCKSEL_3         (0x8UL << RCC_CCIPR4_OTGPHYREFCKSEL_Pos) /*!< 0x00008000 */

#define RCC_CCIPR4_I2C1SEL_Pos             (16UL)
#define RCC_CCIPR4_I2C1SEL_Msk             (0x3UL << RCC_CCIPR4_I2C1SEL_Pos)      /*!< 0x00030000 */
#define RCC_CCIPR4_I2C1SEL                 RCC_CCIPR4_I2C1SEL_Msk
#define RCC_CCIPR4_I2C1SEL_0               (0x1UL << RCC_CCIPR4_I2C1SEL_Pos)      /*!< 0x00010000 */
#define RCC_CCIPR4_I2C1SEL_1               (0x2UL << RCC_CCIPR4_I2C1SEL_Pos)      /*!< 0x00020000 */

#define RCC_CCIPR4_I2C2SEL_Pos             (18UL)
#define RCC_CCIPR4_I2C2SEL_Msk             (0x3UL << RCC_CCIPR4_I2C2SEL_Pos)      /*!< 0x000C0000 */
#define RCC_CCIPR4_I2C2SEL                 RCC_CCIPR4_I2C2SEL_Msk
#define RCC_CCIPR4_I2C2SEL_0               (0x1UL << RCC_CCIPR4_I2C2SEL_Pos)      /*!< 0x00040000 */
#define RCC_CCIPR4_I2C2SEL_1               (0x2UL << RCC_CCIPR4_I2C2SEL_Pos)      /*!< 0x00080000 */

#define RCC_CCIPR4_I2C3SEL_Pos             (20UL)
#define RCC_CCIPR4_I2C3SEL_Msk             (0x3UL << RCC_CCIPR4_I2C3SEL_Pos)      /*!< 0x00300000 */
#define RCC_CCIPR4_I2C3SEL                 RCC_CCIPR4_I2C3SEL_Msk
#define RCC_CCIPR4_I2C3SEL_0               (0x1UL << RCC_CCIPR4_I2C3SEL_Pos)      /*!< 0x00100000 */
#define RCC_CCIPR4_I2C3SEL_1               (0x2UL << RCC_CCIPR4_I2C3SEL_Pos)      /*!< 0x00200000 */

#define RCC_CCIPR4_I2C4SEL_Pos             (22UL)
#define RCC_CCIPR4_I2C4SEL_Msk             (0x3UL << RCC_CCIPR4_I2C4SEL_Pos)      /*!< 0x00C00000 */
#define RCC_CCIPR4_I2C4SEL                 RCC_CCIPR4_I2C4SEL_Msk
#define RCC_CCIPR4_I2C4SEL_0               (0x1UL << RCC_CCIPR4_I2C4SEL_Pos)      /*!< 0x00400000 */
#define RCC_CCIPR4_I2C4SEL_1               (0x2UL << RCC_CCIPR4_I2C4SEL_Pos)      /*!< 0x00800000 */

