zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5e5xx.h
/*******************  Bit definition for I3C_MISR register  ********************/
#define I3C_MISR_CFNFMIS_Pos                 (2U)
#define I3C_MISR_CFNFMIS_Msk                 (0x1UL << I3C_MISR_CFNFMIS_Pos)           /*!< 0x00000004 */
#define I3C_MISR_CFNFMIS                     I3C_MISR_CFNFMIS_Msk                      /*!< Control FIFO Not Full interrupt status */
#define I3C_MISR_SFNEMIS_Pos                 (3U)
#define I3C_MISR_SFNEMIS_Msk                 (0x1UL << I3C_MISR_SFNEMIS_Pos)           /*!< 0x00000008 */
#define I3C_MISR_SFNEMIS                     I3C_MISR_SFNEMIS_Msk                      /*!< Status FIFO Not Empty Interrupt status */
#define I3C_MISR_TXFNFMIS_Pos                (4U)
#define I3C_MISR_TXFNFMIS_Msk                (0x1UL << I3C_MISR_TXFNFMIS_Pos)          /*!< 0x00000010 */
#define I3C_MISR_TXFNFMIS                    I3C_MISR_TXFNFMIS_Msk                     /*!< TX FIFO Not Full Interrupt status */
#define I3C_MISR_RXFNEMIS_Pos                (5U)
#define I3C_MISR_RXFNEMIS_Msk                (0x1UL << I3C_MISR_RXFNEMIS_Pos)          /*!< 0x00000020 */
#define I3C_MISR_RXFNEMIS                    I3C_MISR_RXFNEMIS_Msk                     /*!< RX FIFO Not Empty Interrupt status */
#define I3C_MISR_FCMIS_Pos                   (9U)
#define I3C_MISR_FCMIS_Msk                   (0x1UL << I3C_MISR_FCMIS_Pos)             /*!< 0x00000200 */
#define I3C_MISR_FCMIS                       I3C_MISR_FCMIS_Msk                        /*!< Frame Complete Interrupt status */
#define I3C_MISR_RXTGTENDMIS_Pos             (10U)
#define I3C_MISR_RXTGTENDMIS_Msk             (0x1UL << I3C_MISR_RXTGTENDMIS_Pos)       /*!< 0x00000400 */
#define I3C_MISR_RXTGTENDMIS                 I3C_MISR_RXTGTENDMIS_Msk                  /*!< Reception Target End Interrupt status */
#define I3C_MISR_ERRMIS_Pos                  (11U)
#define I3C_MISR_ERRMIS_Msk                  (0x1UL << I3C_MISR_ERRMIS_Pos)            /*!< 0x00000800 */
#define I3C_MISR_ERRMIS                      I3C_MISR_ERRMIS_Msk                       /*!< Error Interrupt status */
#define I3C_MISR_IBIMIS_Pos                  (15U)
#define I3C_MISR_IBIMIS_Msk                  (0x1UL << I3C_MISR_IBIMIS_Pos)            /*!< 0x00008000 */
#define I3C_MISR_IBIMIS                      I3C_MISR_IBIMIS_Msk                       /*!< IBI Interrupt status */
#define I3C_MISR_IBIENDMIS_Pos                (16U)
#define I3C_MISR_IBIENDMIS_Msk                (0x1UL << I3C_MISR_IBIENDMIS_Pos)         /*!< 0x00010000 */
#define I3C_MISR_IBIENDMIS                   I3C_MISR_IBIENDMIS_Msk                    /*!< IBI End Interrupt status */
#define I3C_MISR_CRMIS_Pos                   (17U)
#define I3C_MISR_CRMIS_Msk                   (0x1UL << I3C_MISR_CRMIS_Pos)             /*!< 0x00020000 */
#define I3C_MISR_CRMIS                       I3C_MISR_CRMIS_Msk                        /*!< Controller-role Interrupt status */
#define I3C_MISR_CRUPDMIS_Pos                (18U)
#define I3C_MISR_CRUPDMIS_Msk                (0x1UL << I3C_MISR_CRUPDMIS_Pos)          /*!< 0x00040000 */
#define I3C_MISR_CRUPDMIS                    I3C_MISR_CRUPDMIS_Msk                     /*!< Controller-role Update Interrupt status */
#define I3C_MISR_HJMIS_Pos                   (19U)
#define I3C_MISR_HJMIS_Msk                   (0x1UL << I3C_MISR_HJMIS_Pos)             /*!< 0x00080000 */
#define I3C_MISR_HJMIS                       I3C_MISR_HJMIS_Msk                        /*!< Hot Join Interrupt status */
#define I3C_MISR_WKPMIS_Pos                  (21U)
#define I3C_MISR_WKPMIS_Msk                  (0x1UL << I3C_MISR_WKPMIS_Pos)            /*!< 0x00200000 */
#define I3C_MISR_WKPMIS                      I3C_MISR_WKPMIS_Msk                       /*!< Wake Up Interrupt status */
#define I3C_MISR_GETMIS_Pos                  (22U)
#define I3C_MISR_GETMIS_Msk                  (0x1UL << I3C_MISR_GETMIS_Pos)            /*!< 0x00400000 */
#define I3C_MISR_GETMIS                      I3C_MISR_GETMIS_Msk                       /*!< Get type CCC received Interrupt status */
#define I3C_MISR_STAMIS_Pos                  (23U)
#define I3C_MISR_STAMIS_Msk                  (0x1UL << I3C_MISR_STAMIS_Pos)            /*!< 0x00800000 */
#define I3C_MISR_STAMIS                      I3C_MISR_STAMIS_Msk                       /*!< Get Status Interrupt status */
#define I3C_MISR_DAUPDMIS_Pos                (24U)
#define I3C_MISR_DAUPDMIS_Msk                (0x1UL << I3C_MISR_DAUPDMIS_Pos)          /*!< 0x01000000 */
#define I3C_MISR_DAUPDMIS                   I3C_MISR_DAUPDMIS_Msk                     /*!< Dynamic Address Update Interrupt status */
#define I3C_MISR_MWLUPDMIS_Pos               (25U)
#define I3C_MISR_MWLUPDMIS_Msk               (0x1UL << I3C_MISR_MWLUPDMIS_Pos)         /*!< 0x02000000 */
#define I3C_MISR_MWLUPDMIS                   I3C_MISR_MWLUPDMIS_Msk                    /*!< Max Write Length Update Interrupt status */
#define I3C_MISR_MRLUPDMIS_Pos               (26U)
#define I3C_MISR_MRLUPDMIS_Msk               (0x1UL << I3C_MISR_MRLUPDMIS_Pos)         /*!< 0x04000000 */
#define I3C_MISR_MRLUPDMIS                   I3C_MISR_MRLUPDMIS_Msk                    /*!< Max Read Length Update Interrupt status */
#define I3C_MISR_RSTMIS_Pos                  (27U)
#define I3C_MISR_RSTMIS_Msk                  (0x1UL << I3C_MISR_RSTMIS_Pos)            /*!< 0x08000000 */
#define I3C_MISR_RSTMIS                      I3C_MISR_RSTMIS_Msk                       /*!< Reset Interrupt status, due to Reset pattern received */
#define I3C_MISR_ASUPDMIS_Pos                (28U)
#define I3C_MISR_ASUPDMIS_Msk                (0x1UL << I3C_MISR_ASUPDMIS_Pos)          /*!< 0x10000000 */
#define I3C_MISR_ASUPDMIS                    I3C_MISR_ASUPDMIS_Msk                     /*!< Activity State Interrupt status */
#define I3C_MISR_INTUPDMIS_Pos               (29U)
#define I3C_MISR_INTUPDMIS_Msk               (0x1UL << I3C_MISR_INTUPDMIS_Pos)         /*!< 0x20000000 */
#define I3C_MISR_INTUPDMIS                   I3C_MISR_INTUPDMIS_Msk                    /*!< Interrupt Update Interrupt status */
#define I3C_MISR_DEFMIS_Pos                  (30U)
#define I3C_MISR_DEFMIS_Msk                  (0x1UL << I3C_IER_DEFIE_Pos)            /*!< 0x40000000 */
#define I3C_MISR_DEFMIS                      I3C_IER_DEFIE_Msk                       /*!< List of Targets Command Received Interrupt status */
#define I3C_MISR_GRPMIS_Pos                  (31U)
#define I3C_MISR_GRPMIS_Msk                  (0x1UL << I3C_MISR_GRPMIS_Pos)            /*!< 0x80000000 */
#define I3C_MISR_GRPMIS                      I3C_MISR_GRPMIS_Msk                       /*!< List of Group Addresses Command Received Interrupt status */

/******************  Bit definition for I3C_DEVR0 register  *******************/
#define I3C_DEVR0_DAVAL_Pos                 (0U)
#define I3C_DEVR0_DAVAL_Msk                 (0x1UL << I3C_DEVR0_DAVAL_Pos)          /*!< 0x00000001 */
#define I3C_DEVR0_DAVAL                     I3C_DEVR0_DAVAL_Msk                     /*!< Dynamic Address Validity */
#define I3C_DEVR0_DA_Pos                    (1U)
#define I3C_DEVR0_DA_Msk                    (0x7FUL << I3C_DEVR0_DA_Pos)            /*!< 0x000000FE */
#define I3C_DEVR0_DA                        I3C_DEVR0_DA_Msk                        /*!< Own Target Device Address */
#define I3C_DEVR0_IBIEN_Pos                 (16U)
#define I3C_DEVR0_IBIEN_Msk                 (0x1UL << I3C_DEVR0_IBIEN_Pos)          /*!< 0x00010000 */
#define I3C_DEVR0_IBIEN                     I3C_DEVR0_IBIEN_Msk                     /*!< IBI Enable */
#define I3C_DEVR0_CREN_Pos                  (17U)
#define I3C_DEVR0_CREN_Msk                  (0x1UL << I3C_DEVR0_CREN_Pos)           /*!< 0x00020000 */
#define I3C_DEVR0_CREN                      I3C_DEVR0_CREN_Msk                      /*!< Controller-role Enable */
#define I3C_DEVR0_HJEN_Pos                  (19U)
#define I3C_DEVR0_HJEN_Msk                  (0x1UL << I3C_DEVR0_HJEN_Pos)           /*!< 0x00080000 */
#define I3C_DEVR0_HJEN                      I3C_DEVR0_HJEN_Msk                      /*!< Hot Join Enable */
#define I3C_DEVR0_AS_Pos                    (20U)
#define I3C_DEVR0_AS_Msk                    (0x3UL << I3C_DEVR0_AS_Pos)             /*!< 0x00300000 */
#define I3C_DEVR0_AS                        I3C_DEVR0_AS_Msk                        /*!< Activity State value update after ENTAx received */
#define I3C_DEVR0_AS_0                      (0x1UL << I3C_DEVR0_AS_Pos)             /*!< 0x00100000 */
#define I3C_DEVR0_AS_1                      (0x2UL << I3C_DEVR0_AS_Pos)             /*!< 0x00200000 */
#define I3C_DEVR0_RSTACT_Pos                (22U)
#define I3C_DEVR0_RSTACT_Msk                (0x3UL << I3C_DEVR0_RSTACT_Pos)         /*!< 0x00C000000 */
#define I3C_DEVR0_RSTACT                    I3C_DEVR0_RSTACT_Msk                    /*!< Reset Action value update after RSTACT received */
#define I3C_DEVR0_RSTACT_0                  (0x1UL << I3C_DEVR0_RSTACT_Pos)         /*!< 0x00400000 */
#define I3C_DEVR0_RSTACT_1                  (0x2UL << I3C_DEVR0_RSTACT_Pos)         /*!< 0x00800000 */
#define I3C_DEVR0_RSTVAL_Pos                (24U)
#define I3C_DEVR0_RSTVAL_Msk                (0x1UL << I3C_DEVR0_RSTVAL_Pos)         /*!< 0x01000000 */
#define I3C_DEVR0_RSTVAL                    I3C_DEVR0_RSTVAL_Msk                    /*!< Reset Action Valid */

